var APP_DATA = {
  "scenes": [
    {
      "id": "0----90",
      "name": "Основное производство высота 90",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.22297398973880078,
        "pitch": 0.4432358325667103,
        "fov": 1.1416113833195811
      },
      "linkHotspots": [
        {
          "yaw": -1.0953991992032002,
          "pitch": 0.06822812698529468,
          "rotation": 9.42477796076938,
          "target": "1-"
        },
        {
          "yaw": -0.23863435831814428,
          "pitch": 0.1622753962706085,
          "rotation": 9.42477796076938,
          "target": "3--"
        },
        {
          "yaw": -0.0456532886016614,
          "pitch": 0.130468607546522,
          "rotation": 3.141592653589793,
          "target": "2---2"
        },
        {
          "yaw": -2.938852272050749,
          "pitch": 0.3729360595013791,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": 2.8653544786421046,
          "pitch": 0.15731297959253254,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": -1.5357743235889423,
          "pitch": 0.00913774957881941,
          "rotation": 3.141592653589793,
          "target": "6-"
        },
        {
          "yaw": 1.9964726891944444,
          "pitch": 0.018487304094000123,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": 2.2326189902701756,
          "pitch": -0.011441179654321232,
          "rotation": 3.141592653589793,
          "target": "8--2"
        },
        {
          "yaw": 2.432508712670689,
          "pitch": -0.018120549554213383,
          "rotation": 3.141592653589793,
          "target": "9--3"
        },
        {
          "yaw": -2.4778803159619613,
          "pitch": -0.03893945984808589,
          "rotation": 3.141592653589793,
          "target": "10--4"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-",
      "name": "ВПП",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 0.5222745048052442,
        "pitch": 0.5790051735418622,
        "fov": 1.2969982474372441
      },
      "linkHotspots": [
        {
          "yaw": 0.15989835326310597,
          "pitch": 0.014429753002115575,
          "rotation": 3.141592653589793,
          "target": "6-"
        },
        {
          "yaw": -2.6491661849809454,
          "pitch": 0.02813791471945315,
          "rotation": 3.141592653589793,
          "target": "3--"
        },
        {
          "yaw": -2.1053816758944386,
          "pitch": -0.04939420277177575,
          "rotation": 0,
          "target": "0----90"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.5689760626601981,
          "pitch": 0.7286822916896689,
          "title": "ВПП",
          "text": "Text"
        },
        {
          "yaw": -2.691216303527412,
          "pitch": 0.5804741987818645,
          "title": "Диспетческая",
          "text": "Text"
        }
      ]
    },
    {
      "id": "2---2",
      "name": "ВЖК законсервированный (2)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 1.6789790679453276,
        "pitch": 0.6447465959578551,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": 1.0082587255839286,
          "pitch": -0.02810712233505086,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 1.8998422085670255,
          "pitch": 0.15888392288411524,
          "rotation": 3.141592653589793,
          "target": "3--"
        },
        {
          "yaw": 2.494171767351,
          "pitch": -0.010916893607308964,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 0.2906960910030456,
          "pitch": -0.026192643302602292,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": 1.1250224329031902,
          "pitch": 0.022191026571416472,
          "rotation": 3.141592653589793,
          "target": "4--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.962954990916498,
          "pitch": 0.763310353131839,
          "title": "ВЖК законсервированное",
          "text": "Text"
        }
      ]
    },
    {
      "id": "3--",
      "name": "ВЖК законсервированный",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.06425687311281436,
        "pitch": 0.3850704172861654,
        "fov": 0.6856766741144539
      },
      "linkHotspots": [
        {
          "yaw": 0.05040733425071764,
          "pitch": 0.04949895517812308,
          "rotation": 0,
          "target": "2---2"
        },
        {
          "yaw": 2.1638239526319385,
          "pitch": -0.09385018593378547,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 2.321809903828763,
          "pitch": -0.0051573068502364094,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": -2.4902412994697016,
          "pitch": -0.02834591209976267,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 1.545424169749607,
          "pitch": 0.0005298847752701619,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": 3.0767570773303508,
          "pitch": -0.052435043246937596,
          "rotation": 3.141592653589793,
          "target": "10--4"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.034090829536228995,
          "pitch": 0.529205780108212,
          "title": "Обрушенная вентиляционная шахта",
          "text": "Text"
        },
        {
          "yaw": -0.04040566029379811,
          "pitch": 0.2692930082802327,
          "title": "Место отрыва",
          "text": "Text"
        },
        {
          "yaw": -2.2195566187534848,
          "pitch": 0.1542786276218031,
          "title": "Энергокомплекс",
          "text": "Text"
        },
        {
          "yaw": -1.653784023013264,
          "pitch": 0.05907003609356387,
          "title": "КПП",
          "text": "Text"
        }
      ]
    },
    {
      "id": "4--",
      "name": "УКПГиК (завод)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -1.8849071401479431,
        "pitch": 0.4504806722852006,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": -1.0258357095201465,
          "pitch": 0.0753043453944855,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": -1.9030096397268075,
          "pitch": -0.04375639198372738,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": 3.0554536942751227,
          "pitch": -0.5130089307829699,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 2.666513410917231,
          "pitch": -0.02849872899915873,
          "rotation": 3.141592653589793,
          "target": "3--"
        },
        {
          "yaw": 0.6007443579492957,
          "pitch": -0.04746793606591737,
          "rotation": 3.141592653589793,
          "target": "10--4"
        },
        {
          "yaw": -1.1092039186991443,
          "pitch": -0.03336895940416085,
          "rotation": 3.141592653589793,
          "target": "8--2"
        },
        {
          "yaw": -0.7601870516800258,
          "pitch": -0.03505667306107618,
          "rotation": 3.141592653589793,
          "target": "9--3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9467626206272506,
          "pitch": 0.3971094534222708,
          "title": "1",
          "text": "Text"
        },
        {
          "yaw": 0.39588401878305746,
          "pitch": 0.31070438479008544,
          "title": "2",
          "text": "Text"
        },
        {
          "yaw": 1.6440794740747586,
          "pitch": 0.3657930172648314,
          "title": "3",
          "text": "Text"
        },
        {
          "yaw": 2.5306560685468256,
          "pitch": 0.7202393387562029,
          "title": "4",
          "text": "Text"
        },
        {
          "yaw": -2.702129219612514,
          "pitch": 0.3713528636163499,
          "title": "5",
          "text": "Text"
        },
        {
          "yaw": 1.0868111686042443,
          "pitch": 0.5786851421877977,
          "title": "7",
          "text": "Text"
        },
        {
          "yaw": -0.16085887773829732,
          "pitch": 0.5498238372033697,
          "title": "8",
          "text": "Text"
        }
      ]
    },
    {
      "id": "5--",
      "name": "Факельная установка",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.46289086837456495,
        "pitch": 0.7928976990078453,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": 2.498217365355785,
          "pitch": 0.10943141391858546,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": 2.813920354007827,
          "pitch": -0.09440701958666153,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 2.9473995469594794,
          "pitch": -0.016693790516750795,
          "rotation": 3.141592653589793,
          "target": "2---2"
        },
        {
          "yaw": 2.5405585496282344,
          "pitch": -0.04243167273429549,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 2.208306995762168,
          "pitch": -0.05227481281018953,
          "rotation": 3.141592653589793,
          "target": "6-"
        },
        {
          "yaw": 0.8184425480414763,
          "pitch": -0.044843812500793945,
          "rotation": 3.141592653589793,
          "target": "10--4"
        },
        {
          "yaw": -1.4995368625314818,
          "pitch": 0.013688412276977147,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": -0.5992832003953623,
          "pitch": -0.0074097909669212925,
          "rotation": 3.141592653589793,
          "target": "8--2"
        },
        {
          "yaw": -0.4819634231738199,
          "pitch": -0.02063074312996882,
          "rotation": 3.141592653589793,
          "target": "9--3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9595202926468058,
          "pitch": 0.5895669452779231,
          "title": "ВФУ",
          "text": "Text"
        },
        {
          "yaw": -1.359877880208785,
          "pitch": 0.4356059341295868,
          "title": "ГФУ",
          "text": "Text"
        }
      ]
    },
    {
      "id": "6-",
      "name": "Карьер",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.5467345937031656,
        "pitch": 0.7001253653764099,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": 2.4280212222145456,
          "pitch": 0.08136546495018848,
          "rotation": 9.42477796076938,
          "target": "1-"
        },
        {
          "yaw": 2.4805297080615505,
          "pitch": 0.03804421084864806,
          "rotation": 3.141592653589793,
          "target": "3--"
        },
        {
          "yaw": 2.7286908589051553,
          "pitch": -0.0011308803820355706,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 2.844518847275582,
          "pitch": 0.026976387427882997,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": 2.929949189208397,
          "pitch": 0.02189383995605887,
          "rotation": 3.141592653589793,
          "target": "5--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "7--1",
      "name": "Куст 1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.4418972981375937,
        "pitch": 0.5985382786554183,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": 0.2556133264606757,
          "pitch": -0.00645612263753037,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": 0.42026994889568847,
          "pitch": -0.003958455208149303,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": 0.4870774023142097,
          "pitch": -0.06744842961973418,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": 0.8094303351194885,
          "pitch": -0.018133894484776647,
          "rotation": 3.141592653589793,
          "target": "2---2"
        },
        {
          "yaw": -2.0613113103529628,
          "pitch": -0.052348190719376575,
          "rotation": 3.141592653589793,
          "target": "8--2"
        },
        {
          "yaw": -1.8234759258910174,
          "pitch": -0.0535184846516259,
          "rotation": 3.141592653589793,
          "target": "9--3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.4557229064776145,
          "pitch": 0.16163487177558267,
          "title": "ГФУ",
          "text": "Text"
        },
        {
          "yaw": -0.0866655442979507,
          "pitch": 0.7031056065735068,
          "title": "Скважина",
          "text": "Text"
        }
      ]
    },
    {
      "id": "8--2",
      "name": "Куст 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.17199312168821734,
        "pitch": 0.5316378492690426,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": -2.0426459516983346,
          "pitch": -0.06991782308980632,
          "rotation": 3.141592653589793,
          "target": "7--1"
        },
        {
          "yaw": -2.351381364178776,
          "pitch": -0.07786355030652992,
          "rotation": 12.566370614359176,
          "target": "0----90"
        },
        {
          "yaw": 1.0849790805532677,
          "pitch": -0.02016221400906204,
          "rotation": 3.141592653589793,
          "target": "9--3"
        },
        {
          "yaw": 2.8778501194712707,
          "pitch": -0.07475612028297363,
          "rotation": 3.141592653589793,
          "target": "10--4"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.4420234563679255,
          "pitch": 0.15525539507346764,
          "title": "ГФУ",
          "text": "Text"
        },
        {
          "yaw": -0.8659766917511291,
          "pitch": 0.38866452978718513,
          "title": "Скважина",
          "text": "Text"
        }
      ]
    },
    {
      "id": "9--3",
      "name": "Куст 3",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -0.3048256821622495,
        "pitch": 0.5029101092496653,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": -2.211074173641194,
          "pitch": -0.03266015092887642,
          "rotation": 3.141592653589793,
          "target": "8--2"
        },
        {
          "yaw": -2.3671747952206896,
          "pitch": -0.05917045657543696,
          "rotation": 0,
          "target": "0----90"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.550767792289582,
          "pitch": 0.7302917813641692,
          "title": "Скважина",
          "text": "Text"
        },
        {
          "yaw": -0.5766888777197359,
          "pitch": 0.15592112801991753,
          "title": "ГФУ",
          "text": "Text"
        }
      ]
    },
    {
      "id": "10--4",
      "name": "Куст 4",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -3.1260003935887504,
        "pitch": 0.7585816300817854,
        "fov": 1.3635740115987254
      },
      "linkHotspots": [
        {
          "yaw": -2.486554298147839,
          "pitch": -0.04903381354413128,
          "rotation": 0,
          "target": "0----90"
        },
        {
          "yaw": -1.4891713264276447,
          "pitch": -0.06789492214454107,
          "rotation": 3.141592653589793,
          "target": "9--3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5036592847478225,
          "pitch": 1.1568121228924007,
          "title": "ГФУ",
          "text": "Text"
        },
        {
          "yaw": -3.0923045608257507,
          "pitch": 0.8012051897924408,
          "title": "Скважина",
          "text": "Text"
        },
        {
          "yaw": 2.40914501301749,
          "pitch": 0.37510208988862637,
          "title": "ВПП",
          "text": "Text"
        },
        {
          "yaw": -0.457378120355342,
          "pitch": 0.04863538469898465,
          "title": "Разведывательная скважина",
          "text": "Text"
        },
        {
          "yaw": 1.3719327436320956,
          "pitch": 0.4564667350939171,
          "title": "Грядово-мочажинный комплекс (Болото)",
          "text": "Text"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
