var APP_DATA = {
  "scenes": [
  {
      "id": "5-",
      "name": "Установка подготовки нефти",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.7802728758132673,
          "pitch": 0.09860119784853794,
          "rotation": 3.141592653589793,
          "target": "7-"
        },
        {
          "yaw": -1.3467526078702754,
          "pitch": 0.03035838814910008,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": -0.27030037707946164,
          "pitch": 0.04048250741968218,
          "rotation": 3.141592653589793,
          "target": "4-"
        },
        {
          "yaw": -0.2707124382884327,
          "pitch": 0.17367464615214168,
          "rotation": 3.141592653589793,
          "target": "6--1"
        },
        {
          "yaw": 0.41216124401009324,
          "pitch": -0.04446257077974636,
          "rotation": 3.141592653589793,
          "target": "8-"
        },
        {
          "yaw": -1.281034831931244,
          "pitch": -0.12321899012111714,
          "rotation": 3.141592653589793,
          "target": "13--19-"
        },
        {
          "yaw": 0.6230312114932239,
          "pitch": -0.20384376915323088,
          "rotation": 3.141592653589793,
          "target": "11--8-"
        }, 
        {
          "yaw": 1.5507392402649787,
          "pitch": -0.07407414765255638,
          "rotation": 3.141592653589793,
          "target": "9--2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.7339589039933401,
          "pitch": 0.1709846903530341,
          "title": "Факельное хозяйство",
          "text": "Text"
        },
        {
          "yaw": 1.3282254797890758,
          "pitch": 0.3663456732286914,
          "title": "Станция управления БКС",
          "text": "Text"
        },
        {
          "yaw": 1.0453104846643342,
          "pitch": 0.4526150609504569,
          "title": "Блочная компрессорная станция",
          "text": "Text"
        },
        {
          "yaw": 1.364778697422345,
          "pitch": 0.7473737663827578,
          "title": "Площадка сепарационная 3-ей очереди",
          "text": "Text"
        },
        {
          "yaw": 2.8448206207447484,
          "pitch": 1.2483154093144222,
          "title": "Площадка подогревателей нефти",
          "text": "Text"
        },
        {
          "yaw": 0.1411184161913468,
          "pitch": 0.7815500552399754,
          "title": "Блок измерительный регулирующий",
          "text": "Text"
        },
        {
          "yaw": 0.28361430506403096,
          "pitch": 0.43915650694816755,
          "title": "Площадка газовых сепараторов",
          "text": "Text"
        },
        {
          "yaw": -0.3932231737771872,
          "pitch": 0.49628214860718955,
          "title": "Площадка сепарационная 2-ой очереди",
          "text": "Text"
        },
        {
          "yaw": -0.892267945688733,
          "pitch": 0.34057114389852217,
          "title": "Площадка подготовки воды",
          "text": "Text"
        },
        {
          "yaw": -1.4644297789758944,
          "pitch": 0.386081964381253,
          "title": "Щитовая станция управления",
          "text": "Text"
        },
        {
          "yaw": -1.9780910455831062,
          "pitch": 0.648176611907072,
          "title": "Насосная внешней и внутренней перекачки",
          "text": "Text"
        },
        {
          "yaw": -3.1394799657659096,
          "pitch": 0.45377565875215176,
          "title": "Площадка слива-налива нефти",
          "text": "Text"
        },
        {
          "yaw": -2.5681588786831906,
          "pitch": 0.30913880030461094,
          "title": "Резервуарный парк нефти",
          "text": "Text"
        },
        {
          "yaw": -1.8203465299609398,
          "pitch": 0.2693888502769717,
          "title": "Блочная кустовая насосная станция №1",
          "text": "Text"
        },
        {
          "yaw": -1.9301489799884237,
          "pitch": 0.18236350640767185,
          "title": "Насосная пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -1.8233452072102097,
          "pitch": 0.17701394335383824,
          "title": "Резервуары запаса противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": -1.529767979403534,
          "pitch": 0.25995565004313903,
          "title": "Резервуары ППД",
          "text": "Text"
        },
        {
          "yaw": -1.307485807315139,
          "pitch": 0.18848524525183308,
          "title": "Служебно-эксплуатационный блок",
          "text": "Text"
        },
        {
          "yaw": -0.8569213487151401,
          "pitch": 0.2576785429188604,
          "title": "Котельная",
          "text": "Text"
        },
        {
          "yaw": 1.930256621646861,
          "pitch": 0.2565207322495091,
          "title": "Факельное хозяйство",
          "text": "Text"
        }
      ]
    },
    {
      "id": "0--",
      "name": "Трубная база",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.9242758085927676,
          "pitch": 0.0637045965178693,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": 0.19576569135638344,
          "pitch": 0.0543457000014449,
          "rotation": 9.42477796076938,
          "target": "1-"
        },
        {
          "yaw": -1.0439678032383473,
          "pitch": 0.1223203356506204,
          "rotation": 3.141592653589793,
          "target": "2----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-",
      "name": "Территория транспортного участка УТТиСТ",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.2677561595687177,
          "pitch": 0.03243800293113175,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": 2.7351421747262563,
          "pitch": 0.024594395077539133,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": -2.7760295970204023,
          "pitch": 0.0754907599824115,
          "rotation": 3.141592653589793,
          "target": "2----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "2----",
      "name": "Территория размещения подрядных организаций",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.9577294808271315,
          "pitch": -0.04276351462567263,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 2.232232298346366,
          "pitch": 0.017125214137053035,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 2.6279513896616713,
          "pitch": 0.023971165941492956,
          "rotation": 3.141592653589793,
          "target": "3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "3-",
      "name": "Вахтовый жилой комплекс",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 3.0013272420563997,
        "pitch": 0.4120738634305958,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.578399812437313,
          "pitch": 0.06014383622038544,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 0.5992378227612107,
          "pitch": -0.002036724982898974,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 1.0404705444013054,
          "pitch": 0.027991640985010946,
          "rotation": 3.141592653589793,
          "target": "2----"
        },
        {
          "yaw": -2.5615452564193912,
          "pitch": -0.007518892618683992,
          "rotation": 3.141592653589793,
          "target": "4-"
        },
        {
          "yaw": -1.2603647798953581,
          "pitch": 0.028614309714408037,
          "rotation": 3.141592653589793,
          "target": "7-"
        },
        {
          "yaw": -1.4932370405850683,
          "pitch": 0.001348870744790176,
          "rotation": 3.141592653589793,
          "target": "5-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "4-",
      "name": "Энергокомплекс №2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [	            
        {
          "yaw": -2.5479125800896707,
          "pitch": 0.01362312244734909,
          "rotation": 3.141592653589793,
          "target": "8-"
        },
        {
          "yaw": -0.18792019867263932,
          "pitch": 0.016103454200820266,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": 0.1110171052455744,
          "pitch": -0.016291088531328768,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": -1.081652675648872,
          "pitch": 0.06717310877659344,
          "rotation": 3.141592653589793,
          "target": "6--1"
        },
        {
          "yaw": -0.80600760106514,
          "pitch": 0.013829146907161416,
          "rotation": 3.141592653589793,
          "target": "7-"
        },
        {
          "yaw": 2.8569761189674843,
          "pitch": -0.13413306666290836,
          "rotation": 3.141592653589793,
          "target": "11--8-"
        },
        {
          "yaw": 2.634453268707521,
          "pitch": -0.03695424174175699,
          "rotation": 3.141592653589793,
          "target": "10--5--"
        },
        {
          "yaw": -2.3220026187584786,
          "pitch": -0.07039126945084817,
          "rotation": 3.141592653589793,
          "target": "9--2"
        }
      ],
      "infoHotspots": [
			{		  
			  "yaw": -1.6075050161180418,
			  "pitch": 0.26349191020874585,
			  "title": "Служебно-эксплуатационный блок",
			  "text": "Text"
			}		
		]
    },    
    {
      "id": "6--1",
      "name": "Энергокомплекс №1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.5352718684519804,
          "pitch": 0.019660779896975455,
          "rotation": 3.141592653589793,
          "target": "4-"
        },
        {
          "yaw": 2.29327313852066,
          "pitch": 0.051896913435989234,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": 1.4602680463284177,
          "pitch": 0.07192443084278999,
          "rotation": 9.42477796076938,
          "target": "7-"
        },
        {
          "yaw": 0.5870575553317625,
          "pitch": 0.08053599888923202,
          "rotation": 3.141592653589793,
          "target": "5-"
        },
        {
          "yaw": -1.6515349525759504,
          "pitch": -0.06258992676898778,
          "rotation": 3.141592653589793,
          "target": "8-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.5123925838561281,
          "pitch": 0.16757289326315394,
          "title": "Факельное хозяйство",
          "text": "Text"
        },
        {
          "yaw": -1.6480643823980792,
          "pitch": 0.7518652903916081,
          "title": "Энергокомплекс №1",
          "text": "Text"
        },
        {
          "yaw": 1.436498665877811,
          "pitch": 0.32718548827365623,
          "title": "Котельная",
          "text": "Text"
        },
        {
          "yaw": 1.066173153072734,
          "pitch": 0.2511555760730584,
          "title": "Площадка подготовки воды",
          "text": "Text"
        },
        {
          "yaw": 0.5829436275210433,
          "pitch": 0.2694686486549358,
          "title": "Площадка сепарационная 2-ой очереди",
          "text": "Text"
        },
        {
          "yaw": 0.16157177159099412,
          "pitch": 0.2608720088568006,
          "title": "Площадка газовых сепараторов",
          "text": "Text"
        },
        {
          "yaw": 0.44205473515957294,
          "pitch": 0.20833528182416217,
          "title": "Блок измерительный регулирующий",
          "text": "Text"
        },
        {
          "yaw": 0.13876212517440933,
          "pitch": 0.1816548020818214,
          "title": "Блочная компрессорная станция",
          "text": "Text"
        },
        {
          "yaw": 0.0543911703090032,
          "pitch": 0.14800921867109906,
          "title": "Станция управления БКС",
          "text": "Text"
        },
        {
          "yaw": 0.32930781349202753,
          "pitch": 0.13769107904111877,
          "title": "Площадка сепарационная 3-ей очереди",
          "text": "Text"
        },
        {
          "yaw": 0.73272511908025,
          "pitch": 0.17815409121960357,
          "title": "Площадка сепарационная 1 и 2 очереди",
          "text": "Text"
        },
        {
          "yaw": 1.0350719690687509,
          "pitch": 0.1965114378972448,
          "title": "Щитовая станция управления",
          "text": "Text"
        },
        {
          "yaw": 1.1857123599645174,
          "pitch": 0.1416262347341739,
          "title": "Блочная кустовая насосная станция №1",
          "text": "Text"
        },
        {
          "yaw": 1.3014028407475209,
          "pitch": 0.15788830566507528,
          "title": "Резервуары ППД",
          "text": "Text"
        },
        {
          "yaw": 1.4306636815408167,
          "pitch": 0.12617892341930848,
          "title": "Резервуары запаса противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": 1.5794396240211306,
          "pitch": 0.18363445847376347,
          "title": "Служебно-эксплуатационный блок",
          "text": "Text"
        }
      ]
    },
    {
      "id": "7-",
      "name": "Резервуары запаса противопожарной воды",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.048391038291392,
          "pitch": 0.07448843011001571,
          "rotation": 3.141592653589793,
          "target": "5-"
        },
        {
          "yaw": 0.1035062881952502,
          "pitch": 0.10035255569053803,
          "rotation": 3.141592653589793,
          "target": "6--1"
        },
        {
          "yaw": -0.37651711448418546,
          "pitch": 0.02417764571841552,
          "rotation": 3.141592653589793,
          "target": "4-"
        },
        {
          "yaw": -1.6361186696196768,
          "pitch": 0.05409276004577812,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": -1.799747343912692,
          "pitch": 0.0125314336777258,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": -2.272536636417369,
          "pitch": -0.005565663504537355,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 0.1869409576009744,
          "pitch": -0.017864366660781172,
          "rotation": 3.141592653589793,
          "target": "8-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.629620569743155,
          "pitch": 0.2756428028191902,
          "title": "Резервуарный парк нефти",
          "text": "Text"
        },
        {
          "yaw": 2.522094491242485,
          "pitch": 0.7309087275946844,
          "title": "Насосная пожаротушения",
          "text": "Text"
        },
        {
          "yaw": 2.58692713815815,
          "pitch": 1.1198856607043801,
          "title": "Резервуары запаса противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": 0.4907193733270532,
          "pitch": 0.574169628212811,
          "title": "Резервуары ППД",
          "text": "Text"
        },
        {
          "yaw": -0.24533965721757767,
          "pitch": 0.31945975505567503,
          "title": "Служебно-эксплуатационный блок",
          "text": "Text"
        },
        {
          "yaw": 1.167639233088419,
          "pitch": 0.4966937890170051,
          "title": "Блочная кустовая насосная станция №1",
          "text": "Text"
        },
        {
          "yaw": 0.7263647842094336,
          "pitch": 0.2815947818313944,
          "title": "Щитовая станция управления",
          "text": "Text"
        }
      ]
    },
    {
      "id": "8-",
      "name": "ГКС",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.5163218037223896,
          "pitch": 0.08268493693060819,
          "rotation": 3.141592653589793,
          "target": "4-"
        },
        {
          "yaw": 0.7590381624488298,
          "pitch": 0.1259437876860634,
          "rotation": 3.141592653589793,
          "target": "6--1"
        },
        {
          "yaw": 0.5251142105384545,
          "pitch": 0.06168911268469479,
          "rotation": 3.141592653589793,
          "target": "5-"
        },
        {
          "yaw": 0.7641885071318164,
          "pitch": 0.05199234451783674,
          "rotation": 3.141592653589793,
          "target": "7-"
        },
        {
          "yaw": 1.141191761601231,
          "pitch": 0.051027172274537236,
          "rotation": 3.141592653589793,
          "target": "3-"
        },
        {
          "yaw": 1.3189916164946158,
          "pitch": 0.037372657994268366,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 1.0623886666908504,
          "pitch": 0.010733158786848662,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 1.7851288743237657,
          "pitch": -0.05962074746224921,
          "rotation": 3.141592653589793,
          "target": "13--19-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.972321718679913,
          "pitch": 0.276943721156659,
          "title": "Площадка буферных емкостей",
          "text": "Text"
        },
        {
          "yaw": 3.10123842771626,
          "pitch": 0.46049320953321704,
          "title": "Насосная ПБТ",
          "text": "Text"
        },
        {
          "yaw": 2.6774511538449293,
          "pitch": 0.3161359667660939,
          "title": "Здание ЗРУ 6 кВ",
          "text": "Text"
        },
        {
          "yaw": 2.1019078224971226,
          "pitch": 0.42333368284323925,
          "title": "Компрессорные установки1",
          "text": "Text"
        },
        {
          "yaw": 1.96830235565701,
          "pitch": 0.5481662921590651,
          "title": "Компрессорные установки2",
          "text": "Text"
        },
        {
          "yaw": 2.7245563482731425,
          "pitch": 0.5156252951897997,
          "title": "Узел приема и редуцирования газа (УПРГ)",
          "text": "Text"
        },
        {
          "yaw": 3.017651091838511,
          "pitch": 0.8008530112297709,
          "title": "АВО",
          "text": "Text"
        },
        {
          "yaw": 2.4736921659873357,
          "pitch": 0.9768749754150381,
          "title": "Блок маслоснабжения",
          "text": "Text"
        },
        {
          "yaw": 1.7749287809803285,
          "pitch": 0.35894481111039234,
          "title": "Станция газового пожаротушения",
          "text": "Text"
        },
        {
          "yaw": 1.584259856858333,
          "pitch": 0.3726202711956539,
          "title": "Компрессорные установки3",
          "text": "Text"
        },
        {
          "yaw": 1.3549937590113288,
          "pitch": 0.42050910223905724,
          "title": "Компрессорные установки4",
          "text": "Text"
        },
        {
          "yaw": 0.9598797232968757,
          "pitch": 0.5402446960982648,
          "title": "Дизельная электростанция",
          "text": "Text"
        },
        {
          "yaw": 0.8895672646362023,
          "pitch": 0.40656857371775956,
          "title": "Блок энергетический",
          "text": "Text"
        },
        {
          "yaw": 0.7056994570990618,
          "pitch": 0.4177715293494071,
          "title": "Блок обогрева вахтового персонала",
          "text": "Text"
        },
        {
          "yaw": 2.3207658548067265,
          "pitch": 1.3666111169126012,
          "title": "Установка подготовки топливного газа №2",
          "text": "Text"
        },
        {
          "yaw": 0.864844999076233,
          "pitch": 1.248853036894939,
          "title": "Узел замера газа",
          "text": "Text"
        },
        {
          "yaw": 0.9861305078149165,
          "pitch": 0.8845712479727581,
          "title": "Площадка факельного сепаратора",
          "text": "Text"
        },
        {
          "yaw": 1.3366968727159847,
          "pitch": 0.7853506977081501,
          "title": "Площадка фильтр-сепараторов",
          "text": "Text"
        },
        {
          "yaw": -0.3954680890235558,
          "pitch": 0.9112312811052146,
          "title": "Расходная емкость метанола",
          "text": "Text"
        },
        {
          "yaw": -0.09370000232098974,
          "pitch": 0.5693148044878313,
          "title": "Резервуары хранения метанола",
          "text": "Text"
        },
        {
          "yaw": -0.45961727993310575,
          "pitch": 0.6065992520555454,
          "title": "Насосная перекачки метанола №1",
          "text": "Text"
        },
        {
          "yaw": -0.6328913508364167,
          "pitch": 0.5369010960968712,
          "title": "Насосная перекачки метанола №2",
          "text": "Text"
        },
        {
          "yaw": -1.7081207531390064,
          "pitch": 0.4993040556052595,
          "title": "Установка комплексной подготовки газа и конденсата",
          "text": "Text"
        },
        {
          "yaw": -1.524263099798258,
          "pitch": 0.9507476332674507,
          "title": "Блок обогрева вахтового персонала",
          "text": "Text"
        },
        {
          "yaw": -2.6246688035198495,
          "pitch": 0.41871115510338797,
          "title": "Узел замера газа",
          "text": "Text"
        },
        {
          "yaw": -2.5515356231503112,
          "pitch": 0.34714856689802787,
          "title": "Ресиверы азота",
          "text": "Text"
        },
        {
          "yaw": -2.370761847073279,
          "pitch": 0.37332597874819484,
          "title": "Площадка входных теплоообменников",
          "text": "Text"
        },
        {
          "yaw": -2.0976822284523315,
          "pitch": 0.3638462000219409,
          "title": "АВО ПБТ",
          "text": "Text"
        },
        {
          "yaw": -2.061489960636882,
          "pitch": 0.44263956721101216,
          "title": "АВО стабильного конденсата",
          "text": "Text"
        },
        {
          "yaw": -1.9277316642965907,
          "pitch": 0.35905355692365326,
          "title": "Площадка рефлюксной екмкости",
          "text": "Text"
        },
        {
          "yaw": -1.7848464713830055,
          "pitch": 0.37097117960321135,
          "title": "Площадка дренажных емкостей",
          "text": "Text"
        },
        {
          "yaw": -1.6145507534296613,
          "pitch": 0.3057509717173197,
          "title": "Площадка ректификационных колонн",
          "text": "Text"
        },
        {
          "yaw": -1.4759555047700115,
          "pitch": 0.27786491270047975,
          "title": "Площадка печей нагрева конденсата",
          "text": "Text"
        },
        {
          "yaw": -1.4305090629808426,
          "pitch": 0.22575160371560976,
          "title": "Насосная пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -1.3243596840395657,
          "pitch": 0.18560354846270144,
          "title": "Резервуары хранения противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": -1.1009374150385902,
          "pitch": 0.23837704136800397,
          "title": "Комплектная трансформаторная подстанция",
          "text": "Text"
        },
        {
          "yaw": -0.8981437081899593,
          "pitch": 0.2672255297027384,
          "title": "Дизельная электростанция",
          "text": "Text"
        },
        {
          "yaw": -1.1363696225788775,
          "pitch": 0.3638422295946828,
          "title": "АВО тосола",
          "text": "Text"
        },
        {
          "yaw": -0.5132530003023952,
          "pitch": 0.3980039671727056,
          "title": "Станция пенного пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -0.7625508245989447,
          "pitch": 0.335245692735171,
          "title": "Воздушно-компрессорная станция",
          "text": "Text"
        },
        {
          "yaw": -0.39577700046185704,
          "pitch": 0.3343783298150349,
          "title": "Станция газового пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -0.6190001322044836,
          "pitch": 0.3328117935421364,
          "title": "Азотно-воздушная компрессорная",
          "text": "Text"
        },
        {
          "yaw": -0.7052966931028273,
          "pitch": 0.27940923848528953,
          "title": "Насосная ШФЛУ №2",
          "text": "Text"
        },
        {
          "yaw": -0.6293412932099578,
          "pitch": 0.28015534809271614,
          "title": "Насосная ШФЛУ",
          "text": "Text"
        },
        {
          "yaw": -0.5756520600401185,
          "pitch": 0.2778143515501359,
          "title": "Площадка емкостей",
          "text": "Text"
        },
        {
          "yaw": -0.5122720147731901,
          "pitch": 0.2763705521519668,
          "title": "Площадка фильтр-сепараторов",
          "text": "Text"
        },
        {
          "yaw": -0.5337242860055262,
          "pitch": 0.23445515678506368,
          "title": "Узел подключения №2",
          "text": "Text"
        },
        {
          "yaw": -0.38614810756370765,
          "pitch": 0.23115833460879998,
          "title": "Узел подключения №1",
          "text": "Text"
        },
        {
          "yaw": -0.32123779527219654,
          "pitch": 0.2206044476454867,
          "title": "Площадка факельного сепаратора",
          "text": "Text"
        },
        {
          "yaw": -0.2287018658117077,
          "pitch": 0.22422046328606982,
          "title": "Компрессорные установки5",
          "text": "Text"
        },
        {
          "yaw": -0.15494163300786212,
          "pitch": 0.2614142861025677,
          "title": "Компрессорные установки6",
          "text": "Text"
        },
        {
          "yaw": -0.03849747907311851,
          "pitch": 0.3071217231586729,
          "title": "Компрессорные установки7",
          "text": "Text"
        },
        {
          "yaw": 0.2769314491881154,
          "pitch": 0.35405124435739666,
          "title": "Блок обогрева вахтового персонала",
          "text": "Text"
        },
        {
          "yaw": 0.16116084225298266,
          "pitch": 0.39837180717372433,
          "title": "Установка подготовки топливного газа №1 (в консервации)",
          "text": "Text"
        },
        {
          "yaw": 0.09104386040119472,
          "pitch": 0.44910723221305204,
          "title": "Узел замера газа",
          "text": "Text"
        },
        {
          "yaw": 0.4961105692376897,
          "pitch": 0.38788323437021077,
          "title": "Блок энергетический",
          "text": "Text"
        }
      ]
    },
    {
      "id": "9--2",
      "name": "Блочная кустовая насосная станция - 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0.5,
        "yaw": 2.5,
        "fov": 1.4
      },
      "linkHotspots": [
        {
          "yaw": -2.853947084050658,
          "pitch": -0.0762503741765439,
          "rotation": 3.141592653589793,
          "target": "4-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "10--5--",
      "name": "Кустовая площадка №5-бис",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.11821817390251965,
          "pitch": -0.2518927147753107,
          "rotation": 3.141592653589793,
          "target": "11--8-"
        },
        {
          "yaw": 2.020823344642605,
          "pitch": -0.07730236984347094,
          "rotation": 3.141592653589793,
          "target": "5-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "11--8-",
      "name": "Кустовая площадка №8",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.8173244763610565,
          "pitch": -0.0878335987492811,
          "rotation": 3.141592653589793,
          "target": "5-"
        },
        {
          "yaw": 2.4488389317059873,
          "pitch": -0.17502913843597945,
          "rotation": 3.141592653589793,
          "target": "13--19-"
        }
      ],
      "infoHotspots": []
    },

    {
      "id": "13--19-",
      "name": "Кустовая площадка №19",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.4535798186791489,
          "pitch": -0.061151996675203435,
          "rotation": 3.141592653589793,
          "target": "5-"
        },
        {
          "yaw": 0.9858857259768801,
          "pitch": -0.07787111458547535,
          "rotation": 3.141592653589793,
          "target": "10--5--"
        },  
        {
          "yaw": 0.6410635548360606,
          "pitch": -0.23261247400190754,
          "rotation": 3.141592653589793,
          "target": "11--8-"
        }
      ],
      "infoHotspots": []
    }
  ],
  "name": "Казанское",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
