var APP_DATA = {
  "scenes": [
    {
      "id": "0--",
      "name": "Обзорная панорама",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.900258384385289,
          "pitch": 0.06770038136517087,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 0.8748000184259901,
          "pitch": 0.5022468569939118,
          "rotation": 3.141592653589793,
          "target": "2--"
        },
        {
          "yaw": 1.8238816798595616,
          "pitch": 0.20371603287050277,
          "rotation": 3.141592653589793,
          "target": "3---1"
        },
        {
          "yaw": 1.5047364545152764,
          "pitch": 0.22932336056211788,
          "rotation": 3.141592653589793,
          "target": "4---2"
        },
        {
          "yaw": 1.3369975238268097,
          "pitch": 0.40395146179918484,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": -0.7571937054593825,
          "pitch": 0.42541464882988933,
          "rotation": 3.141592653589793,
          "target": "6---"
        },
        {
          "yaw": -0.47236968119030465,
          "pitch": 1.010547283030844,
          "rotation": 3.141592653589793,
          "target": "7---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.155219610011379,
          "pitch": 0.46237196073811937,
          "title": "Служебно-эксплуатационный блок с химико-аналитической лабораторией",
          "text": "Text"
        },
        {
          "yaw": -0.781766461928104,
          "pitch": 0.6372696202839165,
          "title": "Центральный пункт управления",
          "text": "Text"
        },
        {
          "yaw": -0.26503284880483235,
          "pitch": 0.8542237793617531,
          "title": "Азотно-воздушная станция",
          "text": "Text"
        },
        {
          "yaw": 0.6851668582946466,
          "pitch": 0.6681154035560564,
          "title": "Наливные установки",
          "text": "Text"
        },
        {
          "yaw": 1.6701481710772983,
          "pitch": 0.39022404222092,
          "title": "Резервуарный парк",
          "text": "Text"
        },
        {
          "yaw": 1.4949691703718173,
          "pitch": 0.5067639915051387,
          "title": "Технологическая насосная",
          "text": "Text"
        }
      ]
    },
    {
      "id": "1-",
      "name": "КПП",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.526504793039126,
          "pitch": -0.22276242498569943,
          "rotation": 0,
          "target": "0--"
        },
        {
          "yaw": 1.6210482528169532,
          "pitch": -0.0047340105516564535,
          "rotation": 3.141592653589793,
          "target": "3---1"
        },
        {
          "yaw": 1.9610657670046256,
          "pitch": -0.02799006795079606,
          "rotation": 3.141592653589793,
          "target": "4---2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.22185456222252675,
          "pitch": 0.4227779284549378,
          "title": "Контрольно-пропускной пункт",
          "text": "Text"
        }
      ]
    },
    {
      "id": "2--",
      "name": "Наливные установки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.932479565425165,
          "pitch": 0.027425456746701826,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": 2.9637072082475466,
          "pitch": -0.010518530378115898,
          "rotation": 3.141592653589793,
          "target": "4---2"
        },
        {
          "yaw": -0.8822884829072812,
          "pitch": 0.00880989205397853,
          "rotation": 3.141592653589793,
          "target": "7---"
        },
        {
          "yaw": -0.5321736454925929,
          "pitch": -0.024758822893492294,
          "rotation": 3.141592653589793,
          "target": "6---"
        },
        {
          "yaw": -1.224677250364243,
          "pitch": -0.7581161489109807,
          "rotation": 0,
          "target": "0--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.49302409597787644,
          "pitch": 0.2236548310565034,
          "title": "Наливные установки",
          "text": "Text"
        },
        {
          "yaw": -3.099300653184848,
          "pitch": 0.18053324119689051,
          "title": "Технологическая насосная",
          "text": "Text"
        }
      ]
    },
    {
      "id": "3---1",
      "name": "Резервуарный парк (1)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.898513700428479,
          "pitch": -0.010601959580638365,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 1.023764688744464,
          "pitch": 0.0886140220295637,
          "rotation": 3.141592653589793,
          "target": "4---2"
        },
        {
          "yaw": 0.3937643396444699,
          "pitch": 0.05709558476214305,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": 0.14349888317264536,
          "pitch": 0.03716428486291612,
          "rotation": 3.141592653589793,
          "target": "7---"
        },
        {
          "yaw": 0.1089070230583129,
          "pitch": -0.20065390385141768,
          "rotation": 0,
          "target": "0--"
        },
        {
          "yaw": 0.23504827657384197,
          "pitch": 0.009936251241986938,
          "rotation": 3.141592653589793,
          "target": "6---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.6382284950373922,
          "pitch": 0.16656403751291649,
          "title": "Резервуарный парк",
          "text": "Text"
        }
      ]
    },
    {
      "id": "4---2",
      "name": "Резервуарный парк (2)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.038818485380881285,
          "pitch": -0.3638245340003827,
          "rotation": 0,
          "target": "0--"
        },
        {
          "yaw": -1.8041774439102216,
          "pitch": 0.10317818845405924,
          "rotation": 3.141592653589793,
          "target": "3---1"
        },
        {
          "yaw": -2.456960743514987,
          "pitch": 0.013536218146812828,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": -0.06514628190758387,
          "pitch": 0.10046695476455625,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": 0.2857980665433253,
          "pitch": 0.07338197596338425,
          "rotation": 3.141592653589793,
          "target": "2--"
        },
        {
          "yaw": 0.06549891474481306,
          "pitch": 0.03719468431910222,
          "rotation": 3.141592653589793,
          "target": "7---"
        },
        {
          "yaw": 0.19915028759966802,
          "pitch": 0.009427722913628145,
          "rotation": 3.141592653589793,
          "target": "6---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.677438707595611,
          "pitch": 0.34707659296898363,
          "title": "Резервуарный парк",
          "text": "Text"
        }
      ]
    },
    {
      "id": "5--",
      "name": "Технологическая насосная",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.4021696383619595,
          "pitch": 0.19021327366841412,
          "rotation": 9.42477796076938,
          "target": "2--"
        },
        {
          "yaw": -0.24149940810858617,
          "pitch": -0.3836263125442141,
          "rotation": 6.283185307179586,
          "target": "0--"
        },
        {
          "yaw": 0.1366770934313628,
          "pitch": 0.0574650555867553,
          "rotation": 9.42477796076938,
          "target": "7---"
        },
        {
          "yaw": 0.33473128348268943,
          "pitch": 0.005029025162674117,
          "rotation": 3.141592653589793,
          "target": "6---"
        },
        {
          "yaw": -2.890117838772177,
          "pitch": 0.09182179349627262,
          "rotation": 3.141592653589793,
          "target": "4---2"
        },
        {
          "yaw": -2.3149668860107475,
          "pitch": 0.08640194043937655,
          "rotation": 3.141592653589793,
          "target": "3---1"
        },
        {
          "yaw": -2.5406925427866405,
          "pitch": -0.016909052906310507,
          "rotation": 3.141592653589793,
          "target": "1-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.07236468631075965,
          "pitch": 0.46533910415350377,
          "title": "Технологическая насосная",
          "text": "Text"
        },
        {
          "yaw": -2.009617604376981,
          "pitch": 0.7900401889679465,
          "title": "Резервуарный парк",
          "text": "Text"
        },
        {
          "yaw": -2.5297420524095564,
          "pitch": 0.27189198743343823,
          "title": "Резервуарный парк",
          "text": "Text"
        }
      ]
    },
    {
      "id": "6---",
      "name": "Центральный пункт управления",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -2.0313695432609844,
        "pitch": 0.350762130585224,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.5021030504163821,
          "pitch": 0.16648042312250944,
          "rotation": 3.141592653589793,
          "target": "7---"
        },
        {
          "yaw": -2.179916304205646,
          "pitch": 0.08959634232860303,
          "rotation": 3.141592653589793,
          "target": "2--"
        },
        {
          "yaw": -1.9147499336441527,
          "pitch": 0.07253364458240696,
          "rotation": 3.141592653589793,
          "target": "5--"
        },
        {
          "yaw": -1.2500618162392279,
          "pitch": -0.6345225428191927,
          "rotation": 0,
          "target": "0--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.2001312835468969,
          "pitch": 0.3480481206156867,
          "title": "Служебно-эксплуатационный блок с химико-аналитической лабораторией",
          "text": "Text"
        },
        {
          "yaw": -1.3092493021778608,
          "pitch": 0.4626267308280916,
          "title": "Центральный пункт управления",
          "text": "Text"
        },
        {
          "yaw": -1.7646200630784445,
          "pitch": 0.25498958811602535,
          "title": "Азотно-воздушная станция",
          "text": "Text"
        }
      ]
    },
    {
      "id": "7---",
      "name": "Азотно-воздушная станция",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.5099885610219062,
          "pitch": 0.014169190333372939,
          "rotation": 3.141592653589793,
          "target": "6---"
        },
        {
          "yaw": 1.5166930636981455,
          "pitch": 0.021009212150438827,
          "rotation": 3.141592653589793,
          "target": "2--"
        },
        {
          "yaw": 1.9778685746445213,
          "pitch": 0.002548108485596501,
          "rotation": 9.42477796076938,
          "target": "5--"
        },
        {
          "yaw": 2.2386302902308337,
          "pitch": -0.027918555525371147,
          "rotation": 3.141592653589793,
          "target": "3---1"
        },
        {
          "yaw": -2.4627413576752577,
          "pitch": -0.8751955314281457,
          "rotation": 0,
          "target": "0--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.963383384173655,
          "pitch": 0.10259461322227637,
          "title": "Служебно-эксплуатационный блок с химико-аналитической лабораторией",
          "text": "Text"
        },
        {
          "yaw": -0.5444427790270971,
          "pitch": 0.16332867441597188,
          "title": "Центральный пункт управления",
          "text": "Text"
        },
        {
          "yaw": 0.4655327437293604,
          "pitch": 0.4340453420768604,
          "title": "Азотно-воздушная станция",
          "text": "Text"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
