var APP_DATA = {
  "scenes": [
    {
      "id": "0-",
      "name": "Вахтовый жилой комплекс",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.46797349834794666,
          "pitch": -0.2543948233418032,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": 0.4662913666626949,
          "pitch": -0.021606771165352257,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": -0.6306765797927945,
          "pitch": 0.03718297073164223,
          "rotation": 3.141592653589793,
          "target": "11--1--"
        },
        {
          "yaw": -0.41515646154098107,
          "pitch": -0.0038242932567200683,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": -0.9222303177535967,
          "pitch": 0.006046062972650645,
          "rotation": 3.141592653589793,
          "target": "7----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.518037399883916,
          "pitch": 0.41633697054422747,
          "title": "Вахтовый жилой комплекс",
          "text": "Text"
        },
        {
          "yaw": 2.3452402011293927,
          "pitch": 0.13262330757291174,
          "title": "Водозабор",
          "text": "Text"
        },
        {
          "yaw": 0.514374868902209,
          "pitch": 0.12256046736959547,
          "title": "АЗС",
          "text": "Text"
        },
        {
          "yaw": -0.4916639148216486,
          "pitch": 0.1663275888917859,
          "title": "Пожарное депо",
          "text": "Text"
        }
      ]
    },
    {
      "id": "1-",
      "name": "Вертолетная площадка",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.600657084442286,
          "pitch": 0.04183144290396257,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": -2.642880642716708,
          "pitch": 0.05383258637561994,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": -2.3810424774102295,
          "pitch": 0.049026055359918885,
          "rotation": 3.141592653589793,
          "target": "11--1--"
        },
        
        {
          "yaw": -1.689982833771717,
          "pitch": -0.2627755431465033,
          "rotation": 0,
          "target": "5--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.4929660395695432,
          "pitch": 0.5617242579709583,
          "title": "Диспетчерская",
          "text": "Text"
        }
      ]
    },
    {
      "id": "3--2",
      "name": "Кустовая площадка №2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
      {         
          "yaw": -0.35,
          "pitch": -0.08057092246600916,
          "rotation": 0,
          "target": "5--"        
      }
      ],
      "infoHotspots": []
    },
    {
      "id": "4--3",
      "name": "Кустовая площадка №3",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.9885347450474447,
          "pitch": -0.7997330827257585,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": 3.0868869234207645,
          "pitch": 0.016052827426706884,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": -2.7738410002851737,
          "pitch": 0.011381235654324584,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": -2.5863620401829337,
          "pitch": 0.007166238844632744,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
      
        {
          "yaw": 1.5667030355894642,
          "pitch": -0.04677575233082365,
          "rotation": 3.141592653589793,
          "target": "1-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "5--",
      "name": "Обзорная панорама",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.02667155271833,
          "pitch": 0.38352693391288817,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": 0.05890150595839039,
          "pitch": 0.32163338367733907,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": 0.32129061713413165,
          "pitch": 0.3393837100863628,
          "rotation": 9.42477796076938,
          "target": "11--1--"
        },
        {
          "yaw": 0.52159580410102,
          "pitch": 0.3027260138627561,
          "rotation": 3.141592653589793,
          "target": "7----"
        },
        
      
        {
          "yaw": 0.46752677110175256,
          "pitch": 0.3832986951060011,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": 0.5917896012397819,
          "pitch": 0.4174569494295426,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
        {
          "yaw": 0.9985942638683056,
          "pitch": 1.2637144830922544,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": 1.0884755956683456,
          "pitch": 0.07797091358849073,
          "rotation": 3.141592653589793,
          "target": "3--2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.759552703941619,
          "pitch": 0.05775693508713431,
          "title": "Коридор коммуникаций на Рыбальное НМ",
          "text": "Text"
        },
        {
          "yaw": 0.9439186823783139,
          "pitch": 0.07102206178540094,
          "title": "Коридор коммуникаций на Останинское НГКМ",
          "text": "Text"
        },
        {
          "yaw": -3.0606270994514624,
          "pitch": 0.11174331371369917,
          "title": "Коридор коммуникаций на Лугинецкое месторождение",
          "text": "Text"
        },
        {
          "yaw": 0.8881093830539086,
          "pitch": 0.2619423329265054,
          "title": "Болото Мирновское",
          "text": "Text"
        },
        {
          "yaw": 0.34699999737512854,
          "pitch": 0.6882641313812403,
          "title": "Кустовая площадка №1",
          "text": "Text"
        }
      ]
    },
    {
      "id": "6--",
      "name": "Площадка сепарации",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
       
  
        {
          "yaw": 1.2222914279081571,
          "pitch": -0.04032056788483018,
          "rotation": 3.141592653589793,
          "target": "7----"
        },
        {
          "yaw": 0.5490644118176178,
          "pitch": 0.07251496776338584,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": 0.1827962299309327,
          "pitch": -0.008973146927861109,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": -1.6512592207103314,
          "pitch": -0.03599139342214208,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": -1.6459511977472197,
          "pitch": -0.27797373399444325,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": -0.9003906557315471,
          "pitch": -0.04869765719340968,
          "rotation": 3.141592653589793,
          "target": "1-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.062214702537398026,
          "pitch": 0.24375308850322952,
          "title": "Резервуарный парк нефти",
          "text": "Text"
        },
        {
          "yaw": 0.6580906031068761,
          "pitch": 0.40753700673995397,
          "title": "Щитовая станция управления",
          "text": "Text"
        },
        {
          "yaw": -0.08521894489183168,
          "pitch": 0.46167040917994306,
          "title": "Насосная внешней и внутренней перекачки",
          "text": "Text"
        },
        {
          "yaw": -2.289864967681382,
          "pitch": 0.8237175039567006,
          "title": "Площадка газовых сепараторов",
          "text": "Text"
        },
        {
          "yaw": -0.954187399557572,
          "pitch": 0.4798326883280897,
          "title": "Площадка печей нагрева нефти",
          "text": "Text"
        },
        {
          "yaw": 2.493877532347442,
          "pitch": 0.7358374311041551,
          "title": "Установка улавливания легких фракций",
          "text": "Text"
        },
        {
          "yaw": -0.1040617429821431,
          "pitch": 0.883706542122134,
          "title": "Площадка сепарации",
          "text": "Text"
        },
        {
          "yaw": -1.0793006442952642,
          "pitch": 0.32746714543107913,
          "title": "Насосная и резервуары метанола",
          "text": "Text"
        },
        {
          "yaw": -1.5954067619708212,
          "pitch": 0.26127411391967215,
          "title": "Площадка входных газовых сепараторов",
          "text": "Text"
        },
        {
          "yaw": -1.5986848301824104,
          "pitch": 0.3882234421570967,
          "title": "Установка подготовки топливного газа",
          "text": "Text"
        },
        {
          "yaw": -1.8312917302862939,
          "pitch": 0.38548673990906224,
          "title": "Пункт подготовки топливного газа",
          "text": "Text"
        }
      ]
    },
    {
      "id": "7----",
      "name": "ГКС",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.6568443295976483,
          "pitch": 0.06833683264883028,
          "rotation": 3.141592653589793,
          "target": "11--1--"
        },
  
       
        {
          "yaw": -0.18342554161013602,
          "pitch": 0.025333833831041375,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
        {
          "yaw": 0.0852007000319599,
          "pitch": 0.05489451987276084,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": 1.084784713283275,
          "pitch": 0.015812019409835898,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": 0.3884587528681891,
          "pitch": -0.0067993267552513,
          "rotation": 3.141592653589793,
          "target": "1-"
        },
        {
          "yaw": -0.002786579164965275,
          "pitch": -0.019741702660624583,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": -0.0034816572609308594,
          "pitch": -0.20917816633348352,
          "rotation": 0,
          "target": "5--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.20054620724903494,
          "pitch": 0.14673468061614514,
          "title": "Ремонтно-механические мастерские",
          "text": "Text"
        },
        {
          "yaw": 1.151234234869003,
          "pitch": 0.2545361826533217,
          "title": "Энергокомплекс №2",
          "text": "Text"
        },
        {
          "yaw": -0.9138433315902397,
          "pitch": 1.0465342635462989,
          "title": "Резервуарный парк хранения метанола",
          "text": "Text"
        },
        {
          "yaw": -0.44529115052159796,
          "pitch": 0.5434446702566795,
          "title": "Насосная станция",
          "text": "Text"
        },
        {
          "yaw": -0.5178740222528244,
          "pitch": 0.32416134801564667,
          "title": "Станция пенного пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -1.6160258720547827,
          "pitch": 0.3352261515224715,
          "title": "Блок маслоснабжения",
          "text": "Text"
        },
        {
          "yaw": -1.3572381353242449,
          "pitch": 0.3348167377538154,
          "title": "Площадка емкостей",
          "text": "Text"
        },
        {
          "yaw": -1.095713409809667,
          "pitch": 0.32867008147664833,
          "title": "Насосная перекачки ШФЛУ",
          "text": "Text"
        },
        {
          "yaw": -0.9044344144967198,
          "pitch": 0.2968170148220928,
          "title": "Площадка фильтр-сепараторов",
          "text": "Text"
        },
        {
          "yaw": -0.7211385653515201,
          "pitch": 0.2611921670280033,
          "title": "Станция газового пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -0.5927708096448399,
          "pitch": 0.22311833074270737,
          "title": "Установка подготовки топливного газа",
          "text": "Text"
        },
        {
          "yaw": -0.34640457466058194,
          "pitch": 0.18262670393212588,
          "title": "Контрольно-пропускной пункт",
          "text": "Text"
        },
        {
          "yaw": -1.1229579621552972,
          "pitch": 0.17866086903583067,
          "title": "КУ-1",
          "text": "Text"
        },
        {
          "yaw": -1.3556356118267363,
          "pitch": 0.18129304045758943,
          "title": "КУ-2",
          "text": "Text"
        },
        {
          "yaw": -0.8834183499905315,
          "pitch": 0.1639912769848042,
          "title": "Азотно-воздушная станция",
          "text": "Text"
        },
        {
          "yaw": -0.1854568123407212,
          "pitch": 0.1938982104979754,
          "title": "Блок обогрева персонала",
          "text": "Text"
        },
        {
          "yaw": -0.13247612537332465,
          "pitch": 0.28210111444641406,
          "title": "Блок энергетический",
          "text": "Text"
        },
        {
          "yaw": 0.27471975387546976,
          "pitch": 0.25351576655127417,
          "title": "Дизельная электростанция",
          "text": "Text"
        }
      ]
    },
    {
      "id": "8--",
      "name": "Резервуары ПДД",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.3597907538356786,
          "pitch": 0.10960546738018451,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
      
        {
          "yaw": -0.5745754035610524,
          "pitch": -0.08057092246600916,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": -0.5771309552691992,
          "pitch": -0.41610347465483954,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": 1.4496073003532448,
          "pitch": 0.07812045892442043,
          "rotation": 3.141592653589793,
          "target": "11--1--"
        },
        {
          "yaw": 1.1624760903436275,
          "pitch": -0.007159603842218587,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": 2.608336379800252,
          "pitch": -0.03373324353987961,
          "rotation": 3.141592653589793,
          "target": "7----"
        },

          {
          "yaw": 0.09334571396694713,
          "pitch": -0.05999507001098969,
          "rotation": 3.141592653589793,
          "target": "1-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.1796691062189986,
          "pitch": 0.2615620933354723,
          "title": "Ремонтно-механические мастерские",
          "text": "Text"
        },
        {
          "yaw": -2.89607896637753,
          "pitch": 0.3542626908121065,
          "title": "Служебно-эксплуатационный блок",
          "text": "Text"
        },
        {
          "yaw": -0.06054074974914059,
          "pitch": 0.261023237714781,
          "title": "Резервуарный парк нефти",
          "text": "Text"
        },
        {
          "yaw": 0.6469743122561091,
          "pitch": 0.2025747567081737,
          "title": "Котельная",
          "text": "Text"
        },
        {
          "yaw": 0.5962201519336254,
          "pitch": 0.5277465971652262,
          "title": "Блочная кустовая насосная станция",
          "text": "Text"
        },
        {
          "yaw": 1.3399794292507714,
          "pitch": 0.2809132937720751,
          "title": "Дизельная электростанция",
          "text": "Text"
        },
        {
          "yaw": 1.7831001440100973,
          "pitch": 0.6085358251092892,
          "title": "Резервуары ППД",
          "text": "Text"
        },
        {
          "yaw": -2.5793766752639886,
          "pitch": 0.8125180573312392,
          "title": "Резервуары запаса противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": -2.4830026539504964,
          "pitch": 0.5995503881590505,
          "title": "Насосная пожаротушения",
          "text": "Text"
        },
        {
          "yaw": -1.2846339825375797,
          "pitch": 0.7130898875130462,
          "title": "Комплектная трансформаторная подстанция",
          "text": "Text"
        },
        {
          "yaw": -1.4990567718034562,
          "pitch": 0.4746894221580149,
          "title": "Щитовая станция управления",
          "text": "Text"
        },
        {
          "yaw": -0.9654846635386409,
          "pitch": 0.31188860000509244,
          "title": "Насосная внешней и внутренней перекачки",
          "text": "Text"
        },
        {
          "yaw": -2.350643707349093,
          "pitch": 0.29568557168703435,
          "title": "Блок обогрева вахтового персонала",
          "text": "Text"
        },
        {
          "yaw": -2.276695592470805,
          "pitch": 0.1430699848722341,
          "title": "Склад",
          "text": "Text"
        },
        {
          "yaw": -1.6085609621708787,
          "pitch": 0.18921653141634565,
          "title": "Установка улавливания легкий фракций",
          "text": "Text"
        },
        {
          "yaw": -1.416987798820955,
          "pitch": 0.17490396728003788,
          "title": "Площадка газовых сепараторов",
          "text": "Text"
        },
        {
          "yaw": -1.237362825553049,
          "pitch": 0.23830331955140593,
          "title": "Площадка сепарации",
          "text": "Text"
        },
        {
          "yaw": -0.9876575625668096,
          "pitch": 0.20076518365697638,
          "title": "Площадка печей нагрева нефти",
          "text": "Text"
        },
        {
          "yaw": -0.8464493660211279,
          "pitch": 0.1788354923819302,
          "title": "Насосная и резервуары метанола",
          "text": "Text"
        }
      ]
    },
    {
      "id": "11--1--",
      "name": "Энергокомплекс №1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.5686494775253568,
          "pitch": 0.012043157584123776,
          "rotation": 3.141592653589793,
          "target": "0-"
        },
        {
          "yaw": 0.5415979568438196,
          "pitch": -0.051459899296387945,
          "rotation": 9.42477796076938,
          "target": "1-"
        },
        {
          "yaw": 0.03710820182782015,
          "pitch": -0.05339118933232179,
          "rotation": 3.141592653589793,
          "target": "4--3"
        },
        {
          "yaw": 0.04077506128870212,
          "pitch": -0.20656902979758662,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": -0.7177602510783121,
          "pitch": 0.09928942315057299,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": -0.5754503508156628,
          "pitch": 0.0426057172563965,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
        
        {
          "yaw": -2.212316527441148,
          "pitch": 0.06262847755202117,
          "rotation": 3.141592653589793,
          "target": "7----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.583884864523286,
          "pitch": 0.2433474936999449,
          "title": "Энергокомплекс №2",
          "text": "Text"
        },
        {
          "yaw": -0.18891217975107644,
          "pitch": 0.4761293503789137,
          "title": "Энергокомплекс №1",
          "text": "Text"
        },
        {
          "yaw": 1.4208616652038302,
          "pitch": 0.1748049282964672,
          "title": "Пожарное депо",
          "text": "Text"
        },
        {
          "yaw": -1.038385499840663,
          "pitch": 0.2855896287491735,
          "title": "Ремонтно-механические мастерские",
          "text": "Text"
        },
        {
          "yaw": -0.40425019537789453,
          "pitch": 0.27195864279505955,
          "title": "Дизельная электростанция",
          "text": "Text"
        },
        {
          "yaw": 0.008463403766825195,
          "pitch": 0.1853675570814559,
          "title": "Котельная",
          "text": "Text"
        },
        {
          "yaw": -0.3741612088130992,
          "pitch": 0.1152570535062658,
          "title": "Резервуарный парк нефти",
          "text": "Text"
        },
        {
          "yaw": -0.49172784970557437,
          "pitch": 0.19178227094147715,
          "title": "Блочная кустовая насосная станция",
          "text": "Text"
        },
        {
          "yaw": -0.6599353377640931,
          "pitch": 0.22602607170955835,
          "title": "Резервуары ППД",
          "text": "Text"
        },
        {
          "yaw": -0.8105421329362308,
          "pitch": 0.15853727231884918,
          "title": "Резервуары запаса противопожарной воды",
          "text": "Text"
        },
        {
          "yaw": -1.029226804912124,
          "pitch": 0.16511831787157938,
          "title": "СЭБ",
          "text": "Text"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
